Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G70A.tmx
Source language: en_us
Languages: zh_cn

source: How ancient philosophy saved my life
zh_cn: 古代哲学拯救了我的生活

source: It was around this time of year, just over a decade ago, that I had a breakdown.
zh_cn: 差不多十年前的这个时候，我的精神状态非常糟糕。

source: During my three years at university, my mental health had got worse and worse.
zh_cn: 在大学的三年里我的精神变得越来越差。

source: It started with panic attacks, that arose out of nowhere like tornadoes.
zh_cn: 在一开始，我患了急性恐惧症，这病就像凭空出现的龙卷风一样刮进了我的生活。

source: Then came the mood swings, depression, and a general feeling that I was no longer in control of myself.
zh_cn: 紧接着就是情绪波动，沮丧和无法控制自己。

source: What terrified me was the prospect I'd permanently upset up my neuro-chemical balance with drugs.
zh_cn: 让我害怕的是我服用药物打乱了我的神经化学平衡。

source: My friends and I had messed around with LSD and Ecstasy, and had some good times, but I'd seen friends get badly hurt and sent to mental homes.
zh_cn: 我的朋友和我靠着药物胡混了一段时间，但是随后我眼看着朋友受到药物的严重伤害后被送进精神病院。

source: If my own depression and panic attacks were neuro-chemically determined, then perhaps there was nothing I could do about it, other than take different drugs for the rest of my life.
zh_cn: 如果我得的病确实因为我的神经有问题，那我的余生或许只能靠服用各种各样的药物来过活了。

source: My literature degree couldn't help me get a handle on what was going on inside me.
zh_cn: 我的文学学位没法帮助我控制自己。

source: It meant I could analyse the feelings of Hamlet or Madame Bovary, but my own emotions were beyond my comprehension or control.
zh_cn: 这就意味着我能分析哈姆雷特或包法利夫人的情感，但是却无法理解自我。

source: Hamlet may have been another youth 'blasted with ecstasy', but I think Shakespeare had something else in mind.
zh_cn: 哈姆雷特可能是另一个已经因疯狂而毁灭的年轻人，但是莎士比亚可能不这么想。

source: I didn't discuss my problems with my friends or parents, out of a masochistic sense of shame.
zh_cn: 我没有和我的朋友父母谈论我的苦恼，这是因为一种自作自受的羞愧感。

source: But finally I was forced to ask for help.
zh_cn: 但是最后，梦魇一样的折磨强迫我必须去寻求他人的帮助。

source: The therapist I saw after graduation wasn't much use, so I did my own research on a new invention dubbed 'the internet', and discovered that depression and anxiety were treatable either with anti-depressants, or with a talking therapy called Cognitive Behavioural Therapy (CBT).
zh_cn: 我已经很久没有进行过治疗，所以我上网去查找相关的治疗方法，发现有两种治疗抑郁症的方法，一个是服用抗抑郁药，另一个是一种被称为“CBT”的谈话治疗。

source: I still clung to the old-fashioned idea that I might be able to reason my way out of my problems, so one evening, I went along to a CBT support group that met in the Royal Festival Hall in London every Thursday.
zh_cn: 我还是选择了保守的治疗方式。于是在一个周二的晚上，我来到了一个CBT小组所在的伦敦皇家节日音乐厅。

source: There was no therapist present, just a group of people coming together to help each other.
zh_cn: 那里并没有抑郁治疗专家，而仅是一些想要帮助彼此的人聚在了一起。

source: We followed a CBT audio course someone had bootlegged from the Net, practiced its exercises, and encouraged each other on.
zh_cn: 我们照着一个从网上下载的CBT治疗录音进行练习，并不断地鼓励彼此。

source: It worked. After a few weeks, I stopped having panic attacks, and haven't had one since.
zh_cn: 几周后，这种方法就起了作用，我的恐惧症消失不见，并且以后再也没复发过。

source: My depression also cleared up, although more slowly.
zh_cn: 我的抑郁症虽然恢复的较慢，但最终也康复了。

source: The road back to mental health took many years and I'm still on it (we all are).
zh_cn: 我坚持了数年的时间来回归到健康的精神状态，我们所有人都是。

source: Others, of course, find anti-depressants more helpful, but in my case I'd say CBT saved my life.
zh_cn: 可能有些人会说抗抑郁药物效果更快更好，但是对我来说，CBT拯救了我。

source: By that time, I was a trainee journalist, so, while reporting on the German mortgage-bond market (as thrilling as it sounds), I quietly started to research CBT.
zh_cn: 那个时候我还是一个菜鸟记者，当我在一边报道德国债权抵押市场的时候，悄悄地开始了调查CBT的一切。

source: One day, I got on a plane to New York to interview the pioneer of CBT, Albert Ellis, on his death-bed.
zh_cn: 在纽约的一天，我有幸采访到了CBT的鼻祖，躺在病床上的AlbertEllis。

source: I did the last ever interview with him before he died, and got the chance to thank him for his work.
zh_cn: 这是他去世前我对他的最后一次采访。

source: Ellis told me he had been directly inspired by ancient Greek philosophy.
zh_cn: Ellis告诉他我他对CBT的灵感来自于古希腊的哲学。

source: He'd trained as a psychoanalyst, but hadn't seen much progress in his patients, despite seeing them sometimes every day for years.
zh_cn: 他曾经想过依靠哲学来治疗他的病人，但是因为没有灵感所以一直没有成功。

source: Then, in the early 1950s, he'd read a line from the Stoic philosopher Epictetus: 'Men are disturbed not by events but by their opinions about them'
zh_cn: 之后在二十世纪50年代初期，他读到了一条斯多葛派哲学家Epictetus说过的话：人会被其对事物的看法所影响，而不是被事物本身。

source: That inspired his new cognitive approach to emotional problems, which is based on the Greeks' theory that our emotions follow our beliefs about the world. 'The soul', as the philosopher and Roman emperor Marcus Aurelius wrote, 'becomes dyed with the colour of its thoughts'.
zh_cn: 这个我们的情绪是由我们对世界的认识所决定的哲学理论，启发了他关于治疗情绪问题的思路。正如马可·奥里利乌斯所言"灵魂，因为思想的渲染才变得缤纷炫彩。"

source: If you change your thoughts, you change your whole experience of the world.
zh_cn: 如果你改变了你的思考方式，那么你也就改变了你的所有经历。

source: Almost all the philosophers of ancient Greece shared this cognitive approach to the emotions. Socrates, the Stoics, the Epicureans, the Sceptics, the Cynics and even the great Plato and Aristotle, all believed that philosophy is a form of therapy that can make people happier and more fulfilled, by teaching them how to examine and change their beliefs.
zh_cn: 几乎所有的古希腊哲学家都同意这一点，苏格拉底、斯多葛学派、伊壁鸠鲁派、疑论学派、慢世者甚至是伟大的柏拉图与亚里士多德，都相信通过哲学教会人们怎样自省和改善自我的认知，可以使人幸福和感到更加充实。

source: First of all, we need to become conscious of our habitual thoughts, and how they create our reality.
zh_cn: 首先，我们需要去认知到我们的思考方式是如何改变现实的。

source: We can do this by engaging in a Socratic dialogue with a therapist or friend, or by tracking our beliefs in a journal.
zh_cn: 这个可以通过和朋友或治疗医师进行苏格拉底式的对话，或在日记中寻觅线索来完成。

source: For example, I realised my emotional problems came in part from my values. I put too much emphasis on winning others' approval, and this made me alienated (which comes from the Latin alienus, meaning 'to make a slave of yourself').
zh_cn: 以我为例，我发现我的精神问题是发自于我的价值观，我太过看重别人对我的评价，这使我成了自己精神的奴隶。

source: Socrates and his followers taught that we can take back possession of ourselves, by choosing intrinsic values like wisdom rather than extrinsic ones like status or power.
zh_cn: 苏格拉底和他的追随者们曾说，我们可以通过寻找我们内在的价值，例如选择智慧而不是权利和地位，来重新掌控我们自己。

source: Once you've examined your beliefs and tried to make them more wise, you need to turn your new insights into new habits.
zh_cn: 在完成了上述的步骤后，你需要将你新的思考方式转变成你新的习惯。

source: The word 'ethics' actually comes from the Greek word for habit.
zh_cn: “伦理”一词实际上来自于形容习惯的希腊词汇。

source: The Greeks had many techniques for creating new habits.
zh_cn: 希腊人有很多形成新习惯的方法。

source: They made maxims, for example, catchphrases to be repeated over and over until they stick in our memories, like Marcus Aurelius' phrase: 'life itself is but what you deem it'.
zh_cn: 例如他们会设定一个不断重复的警语。MarcusAurelius的警语：“你认为生活是什么样子，他就是什么样子。”

source: They'd also carry little handbooks around with them, so that the teachings were always with them.
zh_cn: 他们还会随身携带小本，以便警语能和他们在一起。

source: CBT uses these same techniques.
zh_cn: CBT使用的也是同样道理。

source: And the Greeks understood, perhaps better than CBT, that it also helps if you find a group or community that shares your new way of thinking, so that your ideas become a shared culture.
zh_cn: 希腊人了解到如果可以找到同伴分享你的思考的新方式也会有很大帮助。

source: The Epicureans, for example, left Athens to live in a philosophical commune called the Garden.
zh_cn: 比如说伊壁鸠鲁派在雅典的“伊壁鸠鲁花园”。

source: Their commune was like a lifeboat of wisdom bobbing on the sea of a toxic culture.
zh_cn: 这个团体就像在毒海中摇摆的智慧之舟。

source: The best modern self-help groups understand the importance of group dynamics to self-transformation - think of Alcoholics Anonymous, or Weight Watchers, or the support group I went to in London.
zh_cn: 最好的自助团体十分了解内部思想有机交流转换的重要性。例如“戒酒无名会”，“减肥中心”以及我曾去过的伦敦那家组织。

source: There was also a political aspect to ancient philosophy.
zh_cn: 古希腊政治家也涉及政治方面。

source: Some philosophers, such as Plato and Aristotle, believed that, to heal ourselves, it is not sufficient to change our own individual beliefs.
zh_cn: 一些哲学家，例如柏拉图和亚里士多德，认为仅仅靠改变自我的思考方式是不足以治好自己的。

source: We also need to change our whole society, and infuse its culture with wiser values.
zh_cn: 还需要将更加优越的价值观融入我们的社会。

source: Though of course this can be risky - our society might not want to be changed.
zh_cn: 即使这样很冒险，因为其他人不一定也想要改变。

source: Ancient philosophers were often getting exiled, or even executed, for criticising the ruling powers.
zh_cn: 古希腊哲学家常因为批评正统而被遭到流放又或是处死的惩罚。

source: CBT is very careful to drop any mention of politics or culture, because such matters are controversial and hard to prove scientifically (you can't do a randomised controlled trial for an entire society).
zh_cn: CBT对政治则是非常谨慎，因为有关这点还处在争论中并且也很难证明其对错，因为不可能拿整个社会来做试验。

source: But today, governments are coming round to Aristotle's idea that citizens should be taught the art of living well.
zh_cn: 但如今，政府已经开始重视亚里士多德的观点，认为应该让公民了解生活的艺术。

source: Politicians' new willingness to teach well-being to the masses partly comes from CBT, which has provided an evidence base for the ancient Greeks' insistence that some ways of living are better, wiser and healthier than others.
zh_cn: 政治家们在CBT中找到了使民众提高精神水平的方法，CBT为其提供了许多古希腊哲学家所坚持的使生活更加完善，智慧和健康的方式。

source: Governments have started to use public policy to disseminate CBT and its younger sister, Positive Psychology, in schools, in the NHS, in job-centres, armies and beyond.
zh_cn: 政府已经开始在学校，NHS，职业中心，军队以及更广泛的地区宣传CBT及其新姐妹“积极心理学”。

source: Many countries, including the UK, have also started to measure 'national well-being'.
zh_cn: 许多国家，包括英国，已经开始斟酌考虑“全民福祉”的问题。

source: The welfare state is turning into the 'well-being state', with governments aiming to raise our well-being from a 7 to a 10.
zh_cn: 福利国家正在向福祉国家转变，政府旨在将a7提高到a10。

source: This is exciting, but also risky.
zh_cn: 这让人兴奋的变革也同样让我们感到风险。

source: The well-being state could conceivably turn into an illiberal monster, where citizens must wear forced smiles or risk being diagnosed as sick.
zh_cn: 福祉国家很可能会变成一只偏执狭隘的怪兽，生活其下的民众必须强颜欢笑，或有被强迫诊断为患病的风险。

source: In fact, there's not one path to the good life, but several.
zh_cn: 事实上，通往幸福生活的道路不止一条。

source: The 'science of happiness' is still quite crude, and its evidence mainly consists of simplistic questionnaires.
zh_cn: 现在“幸福科学”的定义还十分粗糙。

source: And Socrates insisted that thinking about the good life for ourselves is is an important part of the good life.
zh_cn: 苏格拉底坚持认为，认为我们自己生活是幸福的也是幸福生活的重要一部分。

source: We shouldn't give too much authority to scientific experts, but rather decide for ourselves what the good life, alone or in philosophy groups.
zh_cn: 我们不应该太过看重科学专家的意见，而应该多关注我们自身对美好生活的认知。

source: Despite these concerns, I'm excited by the new fusion of ancient philosophy and modern psychology.
zh_cn: 尽管有以上的顾虑，我还是很兴奋古哲学能和现代心理学互相融合。

source: If I hadn't come across it, I'd still be stuck in misery.
zh_cn: 如果我没有碰到这些，我现在还会是在痛苦之中。

source: Socrates showed us that we all have the power to heal ourselves and change our characters, at any stage of our lives.
zh_cn: 苏格拉底告诉了我们每个人在其生命中的任何阶段，都有治疗自我和改变自我的能力。

source: We might not become perfect sages like him, but I believe we can all become a little wiser and happier.
zh_cn: 尽管我们不会像他那样完睿智，但是我相信我们都可以变得更加智慧和开心一些。

source: Ancient philosophy for modern lives
zh_cn: 服务于现代生活的古哲学

source: Focus on what you can control, accept what you can't
zh_cn: 专注于你能够控制的事情，接受逆境

source: Rhonda Cornum was a US Army medic when her helicopter was shot down in the first Gulf War.
zh_cn: RhondaCornum曾是一名美军军医。Cornum所乘的直升机在第一次海湾战争被击落后。

source: She was captured, assaulted, and held as a POW.
zh_cn: 她被作为战俘俘虏。

source: She came through that situation without being traumatised, she says, because she focused on what she could control - her thoughts and beliefs - without freaking out over what she couldn't control.
zh_cn: 而她在经历了这些事后并没有受到精神创伤，因为她只专注于她当时所能控制的事情——她的思想和信仰——所以她并没有受到其他事的影响。

source: That attitude is at the heart of Stoic philosophy.
zh_cn: 这就是斯多葛学派的核心观点。

source: Cornum went on to teach resilience to the entire US Army.
zh_cn: Cornum继续在军队中教授士兵如何恢复自己的精神。

source: Choose your role models wisely
zh_cn: 明智定位自我的角色

source: Louis Ferrante grew up in a bad neighbourhood in Brooklyn, and imitated its leading role models, who happened to be gangsters.
zh_cn: LouisFerrante从小生活在一个恶贯满盈的邻居旁，他一直以这个邻居为模仿对象。

source: He joined the Mob, and was in prison by the age of 22.
zh_cn: 后来他加入了黑帮并在22岁被捕。

source: In prison, he came across Plutarch's Parallel Lives, and was inspired by Plutarch's idea that we can choose better role models by reading the biographies of great figures from history.
zh_cn: 在监狱中，他接触到了Plutarch的平行生命理论。并且被Plutarch的理论所启示，可以通过阅读历史上伟人的自传来选择更好的模仿对象。

source: Louis turned his life around, and became a campaigner for prison literacy programmes.
zh_cn: 他彻底改变了自己的生活，成为了一名致力于提高犯人文化水平的社会工作者。

source: Keep track of yourself
zh_cn: 不断的寻找自己

source: The Greeks warned that we often sleepwalk through life, blindly assuming our intuitions are correct.
zh_cn: 古希腊哲学家警示我们，我们会经常浑浑噩噩的浪费自己的生命，盲目地认为自己的观点是正确的。

source: So they urged their students to keep an account of themselves, by tracking their thoughts and behaviour in a journal, like Marcus Aurelius used to do.
zh_cn: 所以古希腊哲学家让他们的学生要不停的记录自己的生活。

source: His Meditations, one of the most famous works of western philosophy, is really his personal thought journal.
zh_cn: MarcusAurelius的《沉思录》就是对他个人精神的记述。

source: We can keep track of ourselves today by using self-tracking apps on our smart-phones, to track our moods, diet, exercise, spending and so on.
zh_cn: 如今我们能够通过翻查自己的手机来寻找追寻我们做过的事、我们的情绪、饮食、锻炼和花销等等。
